app/Controllers/Detalhe_carro.php

    public function index($id)
    {
         $data = [
            'user_name' => session()->get('user')['user_name'] ?? null,

        ];
        $carro = $this->carroModel->find($id);
---
SELECT *
FROM `carros`
WHERE `carros`.`id` = '2'