app/Controllers/Home.php

SELECT *
FROM `carros`
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `carros`
---
    public function index()
    {
        // Define os dados e a paginação (8 por página)
        $data = [
            'cars' => $this->carroModel->paginate(8), // Exibe 8 carros por página
            'pager' => $this->carroModel->pager, // Instância do pager
            'user_name' => session()->get('user')['user_name'] ?? null,

        ];